turbines/Allrun.pre
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

touch a.foam

runApplication blockMesh

runApplication snappyHexMesh -overwrite

runApplication topoSet

# Copy initial conditions
# cp -rf 0.org 0

# runApplication decomposePar

# runParallel $(getApplication)


# runApplication vorticity
# scripts/Allrun.post
