turbines/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
libs
(
    "libturbinesFoam.so"
);

application     pimpleFoam;//pimpleFoam interFoam

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         60.006;

deltaT          0.0137;

writeControl    timeStep;

writeInterval   40;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

// runTimeModifiable yes;

// adjustTimeStep  yes;

// maxCo           5;

/*
DebugSwitches
{
    axialFlowTurbineALSource 1;
    actuatorLineSource  1;
    actuatorLineElement 1;
    LeishmanBeddoes 1;
}
*/

functions
{
  //  #include "sampling" //Include sampling definition
    
}
// ************************************************************************* //
